[{"title":"Oracl安装开始操作系统版本检查不通过","date":"2017-12-22T03:31:06.000Z","path":"2017/12/22/Oracl安装开始操作系统版本检查不通过/","text":"问题：在windows操作系统上安装oracle 10G R2时出现了标题中的错误，如下图： 解决方案：几番查询之后发现是oracle的一个小bug，可以通过更改配置文件“oraparam.ini”来解决，主要修改的地方看下图第一处修改地方： 第二处修改地方 添加内容如下：（实际上就是直接拷贝6.0的所有内容，然后修改成6.1即可） [Windows-6.1-required] #Minimum display colours for OUI to runMIN_DISPLAY_COLORS=256 #Minimum CPU speed required for OUI #CPU=300[Windows-6.1-optional] 不过这只是过了第一关，当安装程序执行后还有一步检查，还是会提示系统版本不支持。后来经过同事的指导。告诉我还有两个文件需要修改。 1，oracle安装包路径\\stage\\prereq\\db_prereqs\\db2，oracle安装包路径\\stage\\prereq\\db\\（下载的版本不一定完全一样。大家根据自己的文件路径寻找下面的文件即可）在上面两个路径中都一个==refhost.xml==文件。在其中加上6.1版本。参照下图。这回就可以正常安装了。","tags":[{"name":"Oracle","slug":"Oracle","permalink":"http://yaojian.me/tags/Oracle/"},{"name":"解决方案","slug":"解决方案","permalink":"http://yaojian.me/tags/解决方案/"},{"name":"Windows","slug":"Windows","permalink":"http://yaojian.me/tags/Windows/"}]},{"title":"Hello World","date":"2017-12-21T08:20:09.256Z","path":"2017/12/21/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]},{"title":"Sakura Editor 英文版","date":"2017-04-16T15:10:36.000Z","path":"2017/04/16/Sakura-Editor-英文版/","text":"做对日的都会用到SakuraEditor。这款编辑器真的很不错。不过因为是日本人发明的，所以不会日语的人使用起来有点麻烦，无意间看到编辑器下载下的讨论，原来已经可以切换英文了。方法参考下边的内容。 Thank you for your contribution to all of us.English version, even only that the toolbar is English is welcome.And, can you software support the color printer because I want print the program code in colors like UltraEdit.Thanks again! Discussion Language preference feature has been implemented on version 2.1.1.0 or later. You can download English language DLL from: https://sourceforge.net/projects/sakura-editor/files/language2/ Unzip and put dll file in the same directory as “sakura.exe“. Start editor and choice language from [共通設定]―[ウィンドウ]-[言語]. Sources has been commited to: https://svn.code.sf.net/p/sakura-editor/code/sakura/trunk2/sakura_lang_en_US Improvement in the translation, or translation into other languages is welcome. Color printing is supported on version 2.1.0.0 or later.","tags":[{"name":"编辑器","slug":"编辑器","permalink":"http://yaojian.me/tags/编辑器/"},{"name":"SakuraEditor","slug":"SakuraEditor","permalink":"http://yaojian.me/tags/SakuraEditor/"}]}]